/*
 Localizable.strings
 CSResourceFork
 
 Created by Charles Srstka on 2/19/12.
 Copyright (c) 2012 __MyCompanyName__. All rights reserved.
 */

"Yes" = "Sim";
"No" = "Não";

"Error" = "Erro";
"Warning" = "Aviso";

"NOT_RSRC_FILE" = "O arquivo “%@” não é um arquivo de recursos.";
"UNKNOWN_ERROR" = "Erro desconhecido";

"FORK_READ_ERROR" = "Erro ao ler os dados da bifurcação de recursos: %d";
"FORK_WRITE_ERROR" = "Erro ao gravar dados para a bifurcação de recursos: %d";

"NOT_A_READ_HANDLE" = "Este identificador de arquivo não pode ler dados.";
"NOT_A_WRITE_HANDLE" = "Este identificador de arquivo não pode gravar dados.";

"RES_TOO_LARGE" = "O tamanho de ‘%@’ ID %d é %lu bytes, mas um recurso não pode ter um tamanho maior que %lu bytes.";
"RES_DATA_TOO_LARGE" = "O tamanho combinado dos recursos neste arquivo de recursos excede %lu bytes, e não é permitido.";

"TOO_MANY_TYPES" = "Um arquivo de recursos não pode conter mais que %lu tipos de recursos.";

"TYPE_LIST_OFFSET_TOO_LARGE" = "O deslocamento da lista de tipo de recurso é %lu, mas o máximo é %lu.";
"NAME_LIST_OFFSET_TOO_LARGE" = "O deslocamento da lista de nome de recurso é %lu, mas o máximo é %lu.";
"RES_NAME_OFFSET_TOO_LARGE" = "O deslocamento para o nome de recurso ‘%@’ ID %d é muito grande; o máximo é %lu.";
"RES_DATA_OFFSET_TOO_LARGE" = "TO deslocamento para os dados de recurso para ‘%@’ ID %d é muito grande; o máximo é %lu.";
"REF_LIST_TOO_LONG" = "A lista de referência para o tipo ‘%@’ é muito longa; ela deve ser menor que %lu bytes.";
"TOO_MANY_RESOURCES" = "Muitos recursos do tipo ‘%@’; o máximo é %lu.";

"INVALID_RESOURCE_TYPE" = "Tipo de recurso inválido ‘%@’.";
"INVALID_RESOURCE_ID" = "Recurso inválido do id %ld; apenas valores de %d para %d são permitidos.";

"RES_DATA_NOT_FOUND" = "Não foi possível encontrar os dados de recursos para ‘%@’ ID %d.";

"RES_ALREADY_EXISTS" = "Um recurso já existe com o tipo ‘%@’ e ID %d.";
"RES_NOT_FOUND" = "Tipo de recurso ‘%@’ %d não encontrado.";

"FORK_ALREADY_EXISTS" = "A bifurcação especificada já existe.";
"FORK_NOT_FOUND" = "TA bifurcação especificada não existe.";

"XATTR_NOT_FOUND" = "O atributo estendido “%@” parece não existir.";
"XATTR_ALREADY_EXISTS" = "Um atributo estendido com o nome “%@” já existe.";

"INVALID_HFS_TYPE" = "Tipo inválido “%@”.";
"INVALID_CREATOR" = "Criador inválido “%@”.";

"DATA_FORK_NOT_SUPPORTED" = "O arquivo “%@” não suporta bifurcação de dados.";
"RSRC_FORK_NOT_SUPPORTED" = "O arquivo “%@” não suporta bifurcação de recursos.";
"XATTRS_NOT_SUPPORTED" = "O arquivo “%@” não suporta atributos estendidos.";
"SPECIAL_XATTR_NOT_SUPPORTED" = "Desculpe, o atributo estendido especial “%@” não é suportado.";
"SPECIAL_XATTR_CANNOT_BE_RENAMED" = "Desculpe, o atributo estendido especial “%@” não pode ser renomeado.";

"UID_NOT_FOUND" = "Nenhum usuário existente com o ID %lu.";
"USER_NAME_NOT_FOUND" = "Nenhum usuário existente com o nome “%@”.";

"GID_NOT_FOUND" = "Nenhum grupo existente com o ID %lu.";
"GROUP_NAME_NOT_FOUND" = "Nenhum grupo existente com o nome “%@”.";

// ACL stuff

"User" = "usuário";
"Group" = "grupo";
"Unknown" = "desconhecido";

"allow" = "aceitar";
"deny" = "recusar";

"ACL_READ_DATA" = "ler";
"ACL_LIST_DIRECTORY" = "lista";
"ACL_WRITE_DATA" = "gravar";
"ACL_ADD_FILE" = "adicionar_arquivo";
"ACL_EXECUTE" = "executar";
"ACL_SEARCH" = "buscar";
"ACL_DELETE" = "apagar";
"ACL_APPEND_DATA" = "anexar";
"ACL_ADD_SUBDIRECTORY" = "adicionar_subdiretório";
"ACL_DELETE_CHILD" = "apagar_secundário";
"ACL_READ_ATTRIBUTES" = "leratributo";
"ACL_WRITE_ATTRIBUTES" = "gravaratributo";
"ACL_READ_EXTATTRIBUTES" = "leratributoestendido";
"ACL_WRITE_EXTATTRIBUTES" = "gravaratributoestendido";
"ACL_READ_SECURITY" = "segurançadeleitura";
"ACL_WRITE_SECURITY" = "segurançadegravação";
"ACL_CHANGE_OWNER" = "chown";

"ACL_FILE_INHERIT" = "arquivo_inherit";
"ACL_DIRECTORY_INHERIT" = "diretório_inherit";
"ACL_LIMIT_INHERIT" = "limite_inherit";
"ACL_ONLY_INHERIT" = "apenas_inherit";

"ACL_PERM_SEPARATOR" = ", ";
